stm32duino/Arduino_Core_STM32/system/Drivers/STM32WB0x_HAL_Driver/Inc/stm32wb0x_hal_pwr.h
/** @brief  Clear a specific PWR flag.
  * @param __FLAG__ specifies the flag to clear.
  *           This parameter can be one of the following values:
  *            /--------------------------------SR1-------------------------------/
  *            @arg @ref PWR_FLAG_WUF0       Wake Up Flag 0. Indicates that a wakeup event
  *                                          was received from the pin PB0.
  *            @arg @ref PWR_FLAG_WUF1       Wake Up Flag 1. Indicates that a wakeup event
  *                                          was received from the pin PB1.
  *            @arg @ref PWR_FLAG_WUF2       Wake Up Flag 2. Indicates that a wakeup event
  *                                          was received from the pin PB2.
  *            @arg @ref PWR_FLAG_WUF3       Wake Up Flag 3. Indicates that a wakeup event
  *                                          was received from the pin PB3.
  *            @arg @ref PWR_FLAG_WUF4       Wake Up Flag 4. Indicates that a wakeup event
  *                                          was received from the pin PB4.
  *            @arg @ref PWR_FLAG_WUF5       Wake Up Flag 5. Indicates that a wakeup event
  *                                          was received from the pin PB5.
  *            @arg @ref PWR_FLAG_WUF6       Wake Up Flag 6. Indicates that a wakeup event
  *                                          was received from the pin PB6.
  *            @arg @ref PWR_FLAG_WUF7       Wake Up Flag 7. Indicates that a wakeup event
  *                                          was received from the pin PB7.
  *            @arg @ref PWR_FLAG_WUF8       Wake Up Flag 8. Indicates that a wakeup event
  *                                          was received from the pin PA8.
  *            @arg @ref PWR_FLAG_WUF9       Wake Up Flag 9. Indicates that a wakeup event
  *                                          was received from the pin PA9.
  *            @arg @ref PWR_FLAG_WUF10      Wake Up Flag 10. Indicates that a wakeup event
  *                                          was received from the pin PA10.
  *            @arg @ref PWR_FLAG_WUF11      Wake Up Flag 11. Indicates that a wakeup event
  *                                          was received from the pin PA11.
  *            @arg @ref PWR_FLAG_WBLEF      Wake Up Flag Indicates that a wakeup event
  *                                          was received from the Bluetooth LE.
  *
  *            @arg @ref PWR_FLAG_BHWF       Wake Up Flag Indicates that a wakeup event
  *                                          was received from the Bluetooth LE Host CPU.
  *
  *            @arg @ref PWR_FLAG_IWUF2      Wake Up Flag 11. Indicates that a wakeup event
  *                                          was received from the pin PA11.
  *
  *            /--------------------------------SR3-------------------------------/
  *            @arg @ref PWR_FLAG_WUF12      Wake Up Flag 12. Indicates that a wakeup event
  *                                          was received from the pin PA0.
  *            @arg @ref PWR_FLAG_WUF13      Wake Up Flag 13. Indicates that a wakeup event
  *                                          was received from the pin PA1.
  *            @arg @ref PWR_FLAG_WUF14      Wake Up Flag 14. Indicates that a wakeup event
  *                                          was received from the pin PA2.
  *            @arg @ref PWR_FLAG_WUF15      Wake Up Flag 15. Indicates that a wakeup event
  *                                          was received from the pin PA3.
  *            @arg @ref PWR_FLAG_WUF16      Wake Up Flag 16. Indicates that a wakeup event
  *                                          was received from the pin PB12 or PA4 for STM32wb07.
  *            @arg @ref PWR_FLAG_WUF17      Wake Up Flag 17. Indicates that a wakeup event
  *                                          was received from the pin PB13 or PA5 for STM32wb07.
  *            @arg @ref PWR_FLAG_WUF18      Wake Up Flag 18. Indicates that a wakeup event
  *                                          was received from the pin PB14 or PA6 for STM32wb07.
  *            @arg @ref PWR_FLAG_WUF19      Wake Up Flag 19. Indicates that a wakeup event
  *                                          was received from the pin PB15 or PA7 for STM32wb07.
  *            @arg @ref PWR_FLAG_WUF20      Wake Up Flag 20. Indicates that a wakeup event
  *                                          was received from the pin PB8.
  *            @arg @ref PWR_FLAG_WUF21      Wake Up Flag 21. Indicates that a wakeup event
  *                                          was received from the pin PB9.
  *            @arg @ref PWR_FLAG_WUF22      Wake Up Flag 22. Indicates that a wakeup event
  *                                          was received from the pin PB10.
  *            @arg @ref PWR_FLAG_WUF23      Wake Up Flag 23. Indicates that a wakeup event
  *                                          was received from the pin PB11.
  *            @arg @ref PWR_FLAG_WUF24      Wake Up Flag 24. Indicates that a wakeup event
  *                                          was received from the pin PB12.
  *            @arg @ref PWR_FLAG_WUF25      Wake Up Flag 25. Indicates that a wakeup event
  *                                          was received from the pin PB13.
  *            @arg @ref PWR_FLAG_WUF26      Wake Up Flag 26. Indicates that a wakeup event
  *                                          was received from the pin PB14.
  *            @arg @ref PWR_FLAG_WUF27      Wake Up Flag 27. Indicates that a wakeup event
  *                                          was received from the pin PB15.
  *            @arg @ref PWR_WU_FLAG_ALL        all Wakeup flags.
  *
  *            /--------------------------------EXTSRR-------------------------------/
  *            @arg @ref PWR_FLAG_DEEPSTOPF  System DEEPTSTOP Flag
  *            @arg @ref PWR_FLAG_RFPHASEF   RFPHASE Flag
  * @retval The new state of __FLAG__ (TRUE or FALSE).
  */
#if defined (PWR_CR6_EWU20)
#define __HAL_PWR_CLEAR_FLAG(__FLAG__)( \
                                        ((__FLAG__) == PWR_FLAG_DEEPSTOPF) ? (SET_BIT(PWR->EXTSRR, PWR_EXTSRR_DEEPSTOPF)) : \
                                        ((__FLAG__) == PWR_FLAG_RFPHASEF)  ? (SET_BIT(PWR->EXTSRR, PWR_EXTSRR_RFPHASEF))  : \
                                        ((__FLAG__) == PWR_FLAG_WUF0)      ? (SET_BIT(PWR->SR1,    PWR_SR1_WUF0))         : \
                                        ((__FLAG__) == PWR_FLAG_WUF1)      ? (SET_BIT(PWR->SR1,    PWR_SR1_WUF1))         : \
                                        ((__FLAG__) == PWR_FLAG_WUF2)      ? (SET_BIT(PWR->SR1,    PWR_SR1_WUF2))         : \
                                        ((__FLAG__) == PWR_FLAG_WUF3)      ? (SET_BIT(PWR->SR1,    PWR_SR1_WUF3))         : \
                                        ((__FLAG__) == PWR_FLAG_WUF4)      ? (SET_BIT(PWR->SR1,    PWR_SR1_WUF4))         : \
                                        ((__FLAG__) == PWR_FLAG_WUF5)      ? (SET_BIT(PWR->SR1,    PWR_SR1_WUF5))         : \
                                        ((__FLAG__) == PWR_FLAG_WUF6)      ? (SET_BIT(PWR->SR1,    PWR_SR1_WUF6))         : \
                                        ((__FLAG__) == PWR_FLAG_WUF7)      ? (SET_BIT(PWR->SR1,    PWR_SR1_WUF7))         : \
                                        ((__FLAG__) == PWR_FLAG_WUF8)      ? (SET_BIT(PWR->SR1,    PWR_SR1_WUF8))         : \
                                        ((__FLAG__) == PWR_FLAG_WUF9)      ? (SET_BIT(PWR->SR1,    PWR_SR1_WUF9))         : \
                                        ((__FLAG__) == PWR_FLAG_WUF10)     ? (SET_BIT(PWR->SR1,    PWR_SR1_WUF10))        : \
                                        ((__FLAG__) == PWR_FLAG_WUF11)     ? (SET_BIT(PWR->SR1,    PWR_SR1_WUF11))        : \
                                        ((__FLAG__) == PWR_FLAG_WBLEF)     ? (SET_BIT(PWR->SR1,    PWR_SR1_WBLEF))        : \
                                        ((__FLAG__) == PWR_FLAG_BHWF)      ? (SET_BIT(PWR->SR1,    PWR_SR1_WBLEHCPUF))    : \
                                        ((__FLAG__) == PWR_FLAG_WUF12)     ? (SET_BIT(PWR->SR3,    PWR_SR3_WUF12))        : \
                                        ((__FLAG__) == PWR_FLAG_WUF13)     ? (SET_BIT(PWR->SR3,    PWR_SR3_WUF13))        : \
                                        ((__FLAG__) == PWR_FLAG_WUF14)     ? (SET_BIT(PWR->SR3,    PWR_SR3_WUF14))        : \
                                        ((__FLAG__) == PWR_FLAG_WUF15)     ? (SET_BIT(PWR->SR3,    PWR_SR3_WUF15))        : \
                                        ((__FLAG__) == PWR_FLAG_WUF16)     ? (SET_BIT(PWR->SR3,    PWR_SR3_WUF16))        : \
                                        ((__FLAG__) == PWR_FLAG_WUF17)     ? (SET_BIT(PWR->SR3,    PWR_SR3_WUF17))        : \
                                        ((__FLAG__) == PWR_FLAG_WUF18)     ? (SET_BIT(PWR->SR3,    PWR_SR3_WUF18))        : \
                                        ((__FLAG__) == PWR_FLAG_WUF19)     ? (SET_BIT(PWR->SR3,    PWR_SR3_WUF19))        : \
                                        ((__FLAG__) == PWR_FLAG_WUF20)     ? (SET_BIT(PWR->SR3,    PWR_SR3_WUF20))        : \
                                        ((__FLAG__) == PWR_FLAG_WUF21)     ? (SET_BIT(PWR->SR3,    PWR_SR3_WUF21))        : \
                                        ((__FLAG__) == PWR_FLAG_WUF22)     ? (SET_BIT(PWR->SR3,    PWR_SR3_WUF22))        : \
                                        ((__FLAG__) == PWR_FLAG_WUF23)     ? (SET_BIT(PWR->SR3,    PWR_SR3_WUF23))        : \
                                        ((__FLAG__) == PWR_FLAG_WUF24)     ? (SET_BIT(PWR->SR3,    PWR_SR3_WUF24))        : \
                                        ((__FLAG__) == PWR_FLAG_WUF25)     ? (SET_BIT(PWR->SR3,    PWR_SR3_WUF25))        : \
                                        ((__FLAG__) == PWR_FLAG_WUF26)     ? (SET_BIT(PWR->SR3,    PWR_SR3_WUF26))        : \
                                        ((__FLAG__) == PWR_FLAG_WUF27)     ? (SET_BIT(PWR->SR3,    PWR_SR3_WUF27))        : \
                                        ((__FLAG__) == PWR_FLAG_SR1_ALL)   ? (SET_BIT(PWR->SR1,    PWR_FLAG_SR1_ALL))     : \
                                        ((__FLAG__) == PWR_FLAG_SR3_ALL)   ? (SET_BIT(PWR->SR3,    PWR_FLAG_SR3_ALL))     : \
                                        (SET_BIT(PWR->SR1, PWR_FLAG_SR1_ALL), SET_BIT(PWR->SR3, PWR_FLAG_SR3_ALL)))

#else
#define __HAL_PWR_CLEAR_FLAG(__FLAG__)( \
                                        ((__FLAG__) == PWR_FLAG_DEEPSTOPF)    ? (SET_BIT(PWR->EXTSRR, PWR_EXTSRR_DEEPSTOPF)) : \
                                        ((__FLAG__) == PWR_FLAG_RFPHASEF )    ? (SET_BIT(PWR->EXTSRR, PWR_EXTSRR_RFPHASEF))  : \
                                        ((__FLAG__) == PWR_FLAG_WUF0)         ? (SET_BIT(PWR->SR1,    PWR_SR1_WUF0))         : \
                                        ((__FLAG__) == PWR_FLAG_WUF1)         ? (SET_BIT(PWR->SR1,    PWR_SR1_WUF1))         : \
                                        ((__FLAG__) == PWR_FLAG_WUF2)         ? (SET_BIT(PWR->SR1,    PWR_SR1_WUF2))         : \
                                        ((__FLAG__) == PWR_FLAG_WUF3)         ? (SET_BIT(PWR->SR1,    PWR_SR1_WUF3))         : \
                                        ((__FLAG__) == PWR_FLAG_WUF4)         ? (SET_BIT(PWR->SR1,    PWR_SR1_WUF4))         : \
                                        ((__FLAG__) == PWR_FLAG_WUF5)         ? (SET_BIT(PWR->SR1,    PWR_SR1_WUF5))         : \
                                        ((__FLAG__) == PWR_FLAG_WUF6)         ? (SET_BIT(PWR->SR1,    PWR_SR1_WUF6))         : \
                                        ((__FLAG__) == PWR_FLAG_WUF7)         ? (SET_BIT(PWR->SR1,    PWR_SR1_WUF7))         : \
                                        ((__FLAG__) == PWR_FLAG_WUF8)         ? (SET_BIT(PWR->SR1,    PWR_SR1_WUF8))         : \
                                        ((__FLAG__) == PWR_FLAG_WUF9)         ? (SET_BIT(PWR->SR1,    PWR_SR1_WUF9))         : \
                                        ((__FLAG__) == PWR_FLAG_WUF10)        ? (SET_BIT(PWR->SR1,    PWR_SR1_WUF10))        : \
                                        ((__FLAG__) == PWR_FLAG_WUF11)        ? (SET_BIT(PWR->SR1,    PWR_SR1_WUF11))        : \
                                        ((__FLAG__) == PWR_FLAG_WBLEF)        ? (SET_BIT(PWR->SR1,    PWR_SR1_WBLEF))        : \
                                        ((__FLAG__) == PWR_FLAG_BHWF)         ? (SET_BIT(PWR->SR1,    PWR_SR1_WBLEHCPUF))    : \
                                        ((__FLAG__) == PWR_FLAG_IWUF2)        ? (SET_BIT(PWR->SR1,    PWR_SR1_IWUF2))        : \
                                        ((__FLAG__) == PWR_FLAG_WUF12)        ? (SET_BIT(PWR->SR3,    PWR_SR3_WUF12))        : \
                                        ((__FLAG__) == PWR_FLAG_WUF13)        ? (SET_BIT(PWR->SR3,    PWR_SR3_WUF13))        : \
                                        ((__FLAG__) == PWR_FLAG_WUF14)        ? (SET_BIT(PWR->SR3,    PWR_SR3_WUF14))        : \
                                        ((__FLAG__) == PWR_FLAG_WUF15)        ? (SET_BIT(PWR->SR3,    PWR_SR3_WUF15))        : \
                                        ((__FLAG__) == PWR_FLAG_WUF16)        ? (SET_BIT(PWR->SR3,    PWR_SR3_WUF16))        : \
                                        ((__FLAG__) == PWR_FLAG_WUF17)        ? (SET_BIT(PWR->SR3,    PWR_SR3_WUF17))        : \
                                        ((__FLAG__) == PWR_FLAG_WUF18)        ? (SET_BIT(PWR->SR3,    PWR_SR3_WUF18))        : \
                                        ((__FLAG__) == PWR_FLAG_WUF19)        ? (SET_BIT(PWR->SR3,    PWR_SR3_WUF19))        : \
                                        ((__FLAG__) == PWR_FLAG_SR1_ALL)      ? (SET_BIT(PWR->SR1,    PWR_FLAG_SR1_ALL))     : \
                                        ((__FLAG__) == PWR_FLAG_SR3_ALL)      ? (SET_BIT(PWR->SR3,    PWR_FLAG_SR3_ALL))     : \
                                        (SET_BIT(PWR->SR1, PWR_FLAG_SR1_ALL), SET_BIT(PWR->SR3, PWR_FLAG_SR3_ALL)))
#endif /* PWR_CR6_EWU20 */

/**
  * @brief Enable the PVD Line.
  * @retval None
  */
#define __HAL_PWR_PVD_ENABLE_IT()   SET_BIT(SYSCFG->PWRC_IER, SYSCFG_PWRC_IER_PVD_IE)

/**
  * @brief Disable the PVD Interrupt Line.
  * @retval None
  */
#define __HAL_PWR_PVD_DISABLE_IT()  CLEAR_BIT(SYSCFG->PWRC_IER, SYSCFG_PWRC_IER_PVD_IE)


/**
  * @brief Check whether or not the PVD interrupt flag is set.
  * @retval PVD Line Status.
  */
#define __HAL_PWR_PVD_GET_FLAG()  (READ_BIT(SYSCFG->PWRC_ISCR, SYSCFG_PWRC_ISCR_PVD_ISC)\
                                   == (SYSCFG_PWRC_ISCR_PVD_ISC)) ? 1UL : 0U

/**
  * @brief Clear the PVD interrupt flag.
  * @retval None
  */
#define __HAL_PWR_PVD_CLEAR_FLAG()  SET_BIT(SYSCFG->PWRC_ISCR, SYSCFG_PWRC_ISCR_PVD_ISC)

/**
  * @}
  */


